ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm33c321x/UC13_2_SPI_1.0.xml
        </group>
    <group id="UC13_2_SPI_DMA_TRIG_RX" name="UC13_2_SPI_DMA_TRIG_RX" instances="1" offset="0x1050" instaddr="0x30" description="">
        <register id="UC13_2_SPI_DMA_TRIG_RX_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="RX" description="Receive FIFO event mask." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="UC13_2_SPI_DMA_TRIG_RX_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="RX" description="Receive FIFO event.This interrupt is set if the selected Receive FIFO level has been reached" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
        </register>
        <register id="UC13_2_SPI_DMA_TRIG_RX_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="RX" description="Receive FIFO event mask." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
        </register>
        <register id="UC13_2_SPI_DMA_TRIG_RX_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="RX" description="Set Receive FIFO event." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
        </register>
        </group>
    <group id="UC13_2_SPI_DMA_TRIG_TX" name="UC13_2_SPI_DMA_TRIG_TX" instances="1" offset="0x1080" instaddr="0x30" description="">
        <register id="UC13_2_SPI_DMA_TRIG_TX_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="TX" description="Transmit FIFO event mask." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="UC13_2_SPI_DMA_TRIG_TX_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="TX" description="Transmit FIFO event:
A read returns the current mask for transmit FIFO interrupt. On a write of 1, the mask for transmit FIFO interrupt is set which means the interrupt state will be reflected in MIS.TXMIS. A write of 0 clears the mask which means MIS.TXMIS will not reflect the interrupt." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
        </register>
        <register id="UC13_2_SPI_DMA_TRIG_TX_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="TX" description="Masked Transmit FIFO event" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occurred"/>
            </bitfield>
        </register>
        <register id="UC13_2_SPI_DMA_TRIG_TX_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="TX" description="Set Transmit FIFO event." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
        </register>
        </group>
    <register id="UC13_2_SPI_INTCTL" width="32" offset="0x10E4" description="Interrupt control register">
        <bitfield id="INTEVAL" description="Writing a 1 to this field re-evaluates the interrupt sources." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="EVAL" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
        </bitfield>
    </register>
    <register id="UC13_2_SPI_CTL0" width="32" offset="0x1100" description="SPI control register 0">
        <bitfield id="DSS" description="Data Size Select.
Values 0 - 2 are reserved and shall not be used.
3h = 4_BIT : 4-bit data
SPI allows only values up to 16 Bit" begin="4" end="0" width="5" rwaccess="R/W">
            <bitenum id="DSS_4" value="0x3" description="Data Size Select bits: 4"/>
            <bitenum id="DSS_5" value="0x4" description="Data Size Select bits: 5"/>
            <bitenum id="DSS_6" value="0x5" description="Data Size Select bits: 6"/>
            <bitenum id="DSS_7" value="0x6" description="Data Size Select bits: 7"/>
            <bitenum id="DSS_8" value="0x7" description="Data Size Select bits: 8"/>
            <bitenum id="DSS_9" value="0x8" description="Data Size Select bits: 9"/>
            <bitenum id="DSS_10" value="0x9" description="Data Size Select bits: 10"/>
            <bitenum id="DSS_11" value="0xA" description="Data Size Select bits: 11"/>
            <bitenum id="DSS_12" value="0xB" description="Data Size Select bits: 12"/>
            <bitenum id="DSS_13" value="0xC" description="Data Size Select bits: 13"/>
            <bitenum id="DSS_14" value="0xD" description="Data Size Select bits: 14"/>
            <bitenum id="DSS_15" value="0xE" description="Data Size Select bits: 15"/>
            <bitenum id="DSS_16" value="0xF" description="Data Size Select bits: 16"/>
        </bitfield>
        <bitfield id="FRF" description="Frame format Select" begin="6" end="5" width="2" rwaccess="R/W">
            <bitenum id="MOTOROLA_3WIRE" value="0x0" description="Motorola SPI frame format (3 wire mode)"/>
            <bitenum id="MOTOROLA_4WIRE" value="0x1" description="Motorola SPI frame format (4 wire mode)"/>
            <bitenum id="TI_SYNC" value="0x2" description="TI synchronous serial frame format"/>
            <bitenum id="Reserved" value="0x3" description="Reserved - not to be selected"/>
        </bitfield>
        <bitfield id="SPO" description="CLKOUT polarity (Motorola SPI frame format only)" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="LOW" value="0x0" description="SPI produces a steady state LOW value on the CLKOUT"/>
            <bitenum id="HIGH" value="0x1" description="SPI produces a steady state HIGH value on the CLKOUT"/>
        </bitfield>
        <bitfield id="SPH" description="CLKOUT phase (Motorola SPI frame format only)
This bit selects the clock edge that captures data and enables it to change state. It
has the most impact on the first bit transmitted by either permitting or not permitting a clock transition before the first data capture edge." begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="FIRST" value="0x0" description="Data is captured on the first clock edge transition."/>
            <bitenum id="SECOND" value="0x1" description="Data is captured on the second clock edge transition."/>
        </bitfield>
        <bitfield id="CSCLR" description="Clear shift register counter on CS inactive
This bit is relevant only in the peripheral, CTL1.CP=0." begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable automatic clear of shift register when CS goes to disable."/>
            <bitenum id="ENABLE" value="0x1" description="Enable automatic clear of shift register when CS goes to disable."/>
        </bitfield>
    </register>
    <register id="UC13_2_SPI_STAT" width="32" offset="0x1108" description="Status Register">
        <bitfield id="TXFE" description="Transmit FIFO empty." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="NOT_EMPTY" value="0x0" description="Transmit FIFO is not empty."/>
            <bitenum id="EMPTY" value="0x1" description="Transmit FIFO is empty."/>
        </bitfield>
        <bitfield id="RXFE" description="Receive FIFO empty." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NOT_EMPTY" value="0x0" description="Receive FIFO is not empty."/>
            <bitenum id="EMPTY" value="0x1" description="Receive FIFO is empty."/>
        </bitfield>
        <bitfield id="BUSY" description="Busy" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="IDLE" value="0x0" description="SPI is in idle mode."/>
            <bitenum id="ACTIVE" value="0x1" description="SPI is currently transmitting and/or receiving data"/>
        </bitfield>
        <bitfield id="RXCLR" description="RX FIFO Clear Status" begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="FIFO is not cleared"/>
            <bitenum id="SET" value="0x1" description="FIFO clear is complete"/>
        </bitfield>
        <bitfield id="TXCLR" description="TX FIFO Clear Status" begin="7" end="7" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="FIFO is not cleared"/>
            <bitenum id="SET" value="0x1" description="FIFO clear is complete"/>
        </bitfield>
        <bitfield id="RXFF" description="Receive FIFO Full  The meaning of this bit depends on the state of the FEN bit in the CTL0 register." begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The receiver can receive data."/>
            <bitenum id="SET" value="0x1" description="If the FIFO is disabled (FEN is 0), the receive holding register is full. If the FIFO is enabled (FEN is 1), the receive FIFO is full."/>
        </bitfield>
        <bitfield id="TXFF" description="Transmit FIFO Full  The meaning of this bit depends on the state of the FEN bit in the CTL0 register." begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="CLEARED" value="0x0" description="The transmitter is not full."/>
            <bitenum id="SET" value="0x1" description="If the FIFO is disabled (FEN is 0), the transmit holding register is full. If the FIFO is enabled (FEN is 1), the transmit FIFO is full."/>
        </bitfield>
    </register>
    <register id="UC13_2_SPI_IFLS" width="32" offset="0x110C" description="Interrupt FIFO Level Select Register">
        <bitfield id="TXIFLSEL" description="FIFO Level Select for generating events (interrupt/dma). 
Note: for undefined settings the default configuration is used." begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="LVL_3_4" value="0x1" description="TX FIFO &lt;= 3/4 empty"/>
            <bitenum id="LVL_1_2" value="0x2" description="TX FIFO &lt;= 1/2 empty (default)"/>
            <bitenum id="LVL_1_4" value="0x3" description="TX FIFO &lt;= 1/4 empty"/>
            <bitenum id="LVL_NOT_FULL" value="0x4" description="Opposite of full"/>
            <bitenum id="LVL_EMPTY" value="0x5" description="TX FIFO is empty"/>
            <bitenum id="LVL_ALMOST_EMPTY" value="0x6" description="TX FIFO &lt;= 1"/>
            <bitenum id="LVL_ALMOST_FULL" value="0x7" description="TX_FIFO &gt;= (MAX_FIFO_LEN -1)"/>
        </bitfield>
        <bitfield id="RXIFLSEL" description="FIFO Level Select for generating events (interrupt/dma). 
Note: for undefined settings the default configuration is used." begin="6" end="4" width="3" rwaccess="R/W">
            <bitenum id="LVL_1_4" value="0x1" description="RX FIFO &gt;= 1/4 full"/>
            <bitenum id="LVL_1_2" value="0x2" description="RX FIFO &gt;= 1/2 full (default)"/>
            <bitenum id="LVL_3_4" value="0x3" description="RX FIFO &gt;= 3/4 full"/>
            <bitenum id="LVL_NOT_EMPTY" value="0x4" description="Opposite of empty"/>
            <bitenum id="LVL_FULL" value="0x5" description="RX FIFO is full"/>
            <bitenum id="LVL_ALMOST_FULL" value="0x6" description="RX_FIFO &gt;= (MAX_FIFO_LEN -1)"/>
            <bitenum id="LVL_ALMOST_EMPTY" value="0x7" description="RX_FIFO &lt;= 1"/>
        </bitfield>
        <bitfield id="TXCLR" description="TX FIFO CLEAR. Setting this bit will clear the TX FIFO contents." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable FIFO clear"/>
            <bitenum id="ENABLE" value="0x1" description="Enable FIFO Clear"/>
        </bitfield>
        <bitfield id="RXCLR" description="RX FIFO CLEAR. Setting this bit will clear the RX FIFO contents." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable FIFO clear"/>
            <bitenum id="ENABLE" value="0x1" description="Enable FIFO Clear"/>
        </bitfield>
    </register>
    <register id="UC13_2_SPI_CLKCTL" width="32" offset="0x1110" description="Clock prescaler and divider register.">
        <bitfield id="SCR" description="Serial clock divider:
This is used to generate the transmit and receive bit rate of the SPI.
The SPI bit rate is
(SPI's functional clock frequency)/((SCR+1)*2).
SCR is a value from 0-1023." begin="9" end="0" width="10" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x3FF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="DSAMPLE" description="Delayed sampling value. 
In controller mode the data on the input pin will be delayed sampled by the defined clock cycles of internal functional clock hence relaxing the setup time of input data. This setting is useful in systems where the board delays and external peripheral delays are more than the input setup time of the controller. Please refer to the datasheet for values of controller input setup time and assess what DSAMPLE value meets the requirement of the system.
Note: High values of DSAMPLE can cause HOLD time violations and must be factored in the calculations." begin="31" end="28" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
    </register>
